# FabricWireOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricWireOffset Property
ParameterTypeId Class See Also
---
"Offset along wire direction": Offset along wire direction
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricWireOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricWireOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricWireOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace